[
  {
    "Name": "Matt Rosendale",
    "SummaryLine": "Incumbent U.S. Representative",
    "LongSummary": "Matt Rosendale, 61, has served one term as Montana’s at-large U.S. representative for the entire state before its division into two congressional districts following the release of 2020 census data last year.\n\nRosendale previously served a four-year term as Montana’s state auditor and insurance commissioner from 2017 to 2021 and served in the Montana state Legislature from 2011 to 2016. He was also the GOP nominee to challenge U.S. Sen. Jon Tester in the latter’s 2018 re-election campaign.\n\nWhile in Congress, Rosendale has served on the House Committee on Natural Resources and the House Committee on Veterans’ Affairs. He lives with his wife, Jean, on a ranch near Glendive.\n\nThis biography is based on materials provided by Rosendale’s campaign and verified against public records from the Montana Legislature and U.S. Congress.\n",
    "Race": "US-House-2-East",
    "CampaignWebsiteUrl": "https://mattformontana.com/",
    "CampaignFBPageUrl": "https://www.facebook.com/MattForMontana/",
    "CampaignTwitterUrl": "https://twitter.com/MattForMontana",
    "CampaignInstagramUrl": "https://www.instagram.com/mattformontana/",
    "MtfpCoverageTag": "",
    "createdAt": "2022-04-15T21:33:58.788Z",
    "updatedAt": "2022-06-08T18:10:10.305Z",
    "Party": "R",
    "CampaignYoutubeUrl": "https://www.youtube.com/user/MattForMontana",
    "isIncumbent": true,
    "FECCandidateName": "ROSENDALE, MATT MR.",
    "status": "advancing-to-general",
    "BallotName": "MATT ROSENDALE"
  },
  {
    "Name": "Mitch Heuer",
    "SummaryLine": "Whitefish small business owner",
    "LongSummary": "Mitch Heuer, 59, is a general contractor and small business owner who lives near Whitefish. He’s lived in Montana for roughly six years. Before that, he was a resident of Colorado.\n\nHeuer is the owner of Heuer Homes LLC, which constructs modular homes, and Heuer Labs LLC, which he founded to pursue product development in 2008. He has a professional background in construction, project management, and several other trade skills. \n\nAccording to Heuer’s campaign website, his top policy priorities include finding solutions to housing inaffordability, combatting mass shootings, improving transportation and self-actualization for younger generations.\n\nThis biography was compiled from material on Heuer’s professional and campaign websites, as well as reporting by the Daily Inter Lake. ",
    "Race": "US-House-1-West",
    "CampaignWebsiteUrl": "https://heuerforcongress.com/",
    "CampaignFBPageUrl": "https://www.facebook.com/Mitch-Heuer-For-Congress-102841605748504/",
    "CampaignTwitterUrl": null,
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:08:42.864Z",
    "updatedAt": "2022-06-08T18:12:06.810Z",
    "Party": "R",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": "HEUER, MITCH MR.",
    "status": "lost-primary",
    "BallotName": "MITCH HEUER"
  },
  {
    "Name": "Matt Jette",
    "SummaryLine": "High school government teacher, professor",
    "LongSummary": "Matt Jette, 49, relocated to Missoula in 2021 after previously living in Florida and Arizona. He is a teacher at Sentinel High School and also teaches in the political science department at the University of Montana. He has earned degrees from the University of Montana, Harvard University and Arizona State University.\n\nJette previously campaigned for public office in Arizona. He ran as a Republican in a 2010 bid for governor and registered as a Democrat to run for Congress in 2012 before switching his status to independent. \n\nJette has listed his policy priorities as health care reform, economic adaptability and improving education.  \n\nThis biography was compiled with information from Jette’s campaign website, news reports, and a recent phone interview with the candidate.",
    "Race": "US-House-1-West",
    "CampaignWebsiteUrl": "https://www.jette4montana.com/",
    "CampaignFBPageUrl": "https://www.facebook.com/profile.php?id=100077004363086",
    "CampaignTwitterUrl": "https://twitter.com/@Jette2022",
    "CampaignInstagramUrl": "https://www.instagram.com/jette4montana2022/",
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:09:04.516Z",
    "updatedAt": "2022-06-08T18:12:15.536Z",
    "Party": "R",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": "JETTE, MATTHEW DR.",
    "status": "lost-primary",
    "BallotName": "MATT JETTE"
  },
  {
    "Name": "John Lamb",
    "SummaryLine": "Libertarian activist",
    "LongSummary": "John Lamb is a resident of Bozeman. According to an April 15 Facebook post, Lamb said he is running to represent Montana in Congress to “limit government overreach and spending.” His other policy priorities included investigating corrupt politicians and elected officials, opposing abortion and taxes, and supporting the First and Second Amendments.\n\nAccording to Facebook photos, posts and media articles, Lamb has been a longtime supporter of the Bundy family, which orchestrated an armed takeover of the Malheur National Wildlife Refuge in 2016. In 2020, he unsuccessfully campaigned to represent Senate District 36 in the state Legislature as a Libertarian.\n\nLamb did not list a 2022 campaign website on his filing with the Montana secretary of state and did not submit a completed candidate questionnaire to Montana Free Press.\n\nThis biography was compiled with information from Lamb’s Facebook page, news articles in which Lamb is quoted, and election result records from the secretary of state’s website. ",
    "Race": "US-House-1-West",
    "CampaignWebsiteUrl": null,
    "CampaignFBPageUrl": null,
    "CampaignTwitterUrl": null,
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:09:16.811Z",
    "updatedAt": "2022-06-08T18:12:25.439Z",
    "Party": "L",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": null,
    "status": "advancing-to-general",
    "BallotName": "JOHN LAMB"
  },
  {
    "Name": "Al Olszewski",
    "SummaryLine": "Former Kalispell state senator, orthopedic surgeon",
    "LongSummary": "Olszewski, 59, is a former state lawmaker and orthopedic surgeon. He grew up in Montana and is a resident of Kalispell, where he lives with his wife and family. Olszewski will appear on the ballot as “Al ‘Doc’ Olszewski.”\n\nBefore entering politics, Olszewski served 13 years in the U.S. Air Force as a surgeon beginning in the 1980s. He served three consecutive terms in the state Legislature, first as a representative in 2015 and later as a senator. \n\nOlszewski unsuccessfully campaigned for the Republican nomination for governor in 2020 against eventual winner Greg Gianforte and former state Attorney General Tim Fox. His campaign issues include conservative immigration policies, increased election security and reducing government spending and inflation.\n\nThis biography was compiled with information from Olszewski’s campaign website and legislative archives.",
    "Race": "US-House-1-West",
    "CampaignWebsiteUrl": "https://www.alformontana.com/",
    "CampaignFBPageUrl": "https://www.facebook.com/alformontana",
    "CampaignTwitterUrl": "https://twitter.com/alformontana",
    "CampaignInstagramUrl": "https://www.instagram.com/alformontana/",
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:09:36.240Z",
    "updatedAt": "2022-06-10T14:18:00.136Z",
    "Party": "R",
    "CampaignYoutubeUrl": "https://youtube.com/channel/UC24Qe5GaGGIwQD0mCSPeRcg",
    "isIncumbent": false,
    "FECCandidateName": "OLSZEWSKI, AL",
    "status": "lost-primary",
    "BallotName": "AL \"DOC\" OLSZEWSKI"
  },
  {
    "Name": "Monica Tranel",
    "SummaryLine": "Missoula attorney",
    "LongSummary": "Tranel, 56, grew up in Miles City, Ashland, Broadview and Billings. She currently resides in Missoula. Tranel graduated from Gonzaga University and received her law degree from Rutgers University. \n\nTranel is a two-time Olympic rower, having competed in both the 1996 and 2000 summer games. She moved back to Montana and began working for the Public Service Commission as a staff attorney in 2001. Tranel has spent recent years working in private practice. \n\nTranel made an unsuccessful bid for a seat on the Public Service Commission in 2020. Her campaign issues include increasing regulations and taxes for corporations, supporting affordable housing and higher wages, and climate change resiliency.\n\nThis biography was compiled with information from Tranel’s campaign website and an interview with the candidate.",
    "Race": "US-House-1-West",
    "CampaignWebsiteUrl": "https://monicatranel.com/",
    "CampaignFBPageUrl": "https://www.facebook.com/MonicaTranelForCongress",
    "CampaignTwitterUrl": "https://twitter.com/MonicaTranel",
    "CampaignInstagramUrl": "https://www.instagram.com/monica.tranel/",
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:09:50.929Z",
    "updatedAt": "2022-06-08T18:13:02.233Z",
    "Party": "D",
    "CampaignYoutubeUrl": "https://www.youtube.com/channel/UCmfHRkAFeX3WsfsRI5BMrMA",
    "isIncumbent": false,
    "FECCandidateName": "TRANEL, MONICA",
    "status": "advancing-to-general",
    "BallotName": "MONICA TRANEL"
  },
  {
    "Name": "Tom Winter",
    "SummaryLine": "Rural broadband contractor",
    "LongSummary": "Winter, 35, is a Polson resident who has lived in Montana for roughly a decade. He served one term as a state representative for House District 96, which he won from a Republican incumbent in 2018. He left the Legislature and ran for Congress in 2020, losing in the Democratic primary to Kathleen Williams. \n\nIn the Legislature and his congressional campaigns, Winter has advocated for legalizing marijuana, increasing taxes on the wealthy and creating a universal health care system.\n\nWinter currently works on commission with the company WorldCell, helping localities pursue federal grants to implement broadband infrastructure. \n\nThis biography was compiled using records from the Legislature and the secretary of state’s office, as well as information provided by the candidate’s campaign.",
    "Race": "US-House-1-West",
    "CampaignWebsiteUrl": "https://www.winterformontana.com/",
    "CampaignFBPageUrl": "http://www.facebook.com/WinterForMontana",
    "CampaignTwitterUrl": "https://twitter.com/WinterForMT",
    "CampaignInstagramUrl": "https://www.instagram.com/winterformt/",
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:09:59.802Z",
    "updatedAt": "2022-06-08T18:13:15.293Z",
    "Party": "D",
    "CampaignYoutubeUrl": "https://www.youtube.com/channel/UCVj7DabC44Rs2r820rldMHQ",
    "isIncumbent": false,
    "FECCandidateName": "WINTER, THOMAS",
    "status": "lost-primary",
    "BallotName": "TOM WINTER"
  },
  {
    "Name": "Ryan Zinke",
    "SummaryLine": "Former U.S. Interior Secretary",
    "LongSummary": "Zinke, 60, served as Montana’s sole U.S. congressman from 2014 until 2017, when he relinquished that seat to become the Secretary of the Department of the Interior under former President Donald Trump. Zinke resigned from that position in 2018 after investigations into possible ethics violations, which Zinke dismissed as “false allegations.” In February, the department’s Office of Inspector General found that Zinke had misused his office but had not engaged in criminal conduct.\n\nSince leaving his federal position, Zinke has worked as a contractor for private companies, including ConocoPhillips, Cyber Range Solutions and JVL Enterprises of Dallas. \n\nBefore his election to Congress, Zinke was a state lawmaker in Montana. Zinke served as a U.S. Navy SEAL for over 20 years, retiring in 2008. \n\nThis biography was compiled with information from the secretary of state’s records, national news articles and reporting by KTVH on Zinke’s 2022 financial disclosure. ",
    "Race": "US-House-1-West",
    "CampaignWebsiteUrl": "https://www.ryanzinke.com/",
    "CampaignFBPageUrl": "https://www.facebook.com/ryanzinke",
    "CampaignTwitterUrl": "https://twitter.com/RyanZinke",
    "CampaignInstagramUrl": "https://www.instagram.com/zinkeformontana/",
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:10:13.274Z",
    "updatedAt": "2022-06-10T14:18:07.492Z",
    "Party": "R",
    "CampaignYoutubeUrl": "https://www.youtube.com/channel/UCNsXl014OUkV4CtlXFdVB3g",
    "isIncumbent": false,
    "FECCandidateName": "ZINKE, RYAN K",
    "status": "advancing-to-general",
    "BallotName": "RYAN K ZINKE"
  },
  {
    "Name": "Kyle Austin",
    "SummaryLine": "Billings pharmacist",
    "LongSummary": "Austin, 39, describes himself as a pharmacist, farmer and pilot. He was raised near Havre and holds a pharmacy degree from the University of Montana. He lives in Billings, where he operates a retail pharmacy and a mobile vaccine clinic.\n\nHe says he is running because he believes current elected leaders have failed the state, citing challenges around health care, agriculture and population growth.\n\nThis biography is based on information provided by Austin and materials available on his campaign website, verified against news reports about [his work as a traveling pharmacist](https://montanafreepress.org/2021/08/17/traveling-covid-vaccines-virginia-city-montana/) during the COVID-19 pandemic.\n",
    "Race": "US-House-2-East",
    "CampaignWebsiteUrl": "https://pharm406.com/congress/",
    "CampaignFBPageUrl": null,
    "CampaignTwitterUrl": null,
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:10:46.697Z",
    "updatedAt": "2022-06-08T18:10:15.488Z",
    "Party": "R",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": "AUSTIN, KYLE RAY",
    "status": "lost-primary",
    "BallotName": "KYLE AUSTIN"
  },
  {
    "Name": "James Boyette",
    "SummaryLine": "Bozeman resident",
    "LongSummary": "Boyette, 29, grew up in Idaho and has lived in Bozeman since 2020. He says he’s held a variety of jobs, including farmwork, landscaping, construction, IT, the fitness industry and in medical sales. He also says he has served as a kidney donor and provided CPR for his mother following a heart attack.\n\nAt a May 8 candidate forum, he said he wants to address health care and K-12 education and is frustrated by a divide in American politics “that is being widened by extreme viewpoints on the left and the right and this inability to work together.”\n\nThis biography is based on information provided by Boyette and materials on his website.",
    "Race": "US-House-2-East",
    "CampaignWebsiteUrl": "https://www.boyetteforcongress.com/",
    "CampaignFBPageUrl": "https://www.facebook.com/Jamesmboyette/",
    "CampaignTwitterUrl": null,
    "CampaignInstagramUrl": "https://www.instagram.com/boyette4congress/",
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:11:06.334Z",
    "updatedAt": "2022-06-08T18:10:22.447Z",
    "Party": "R",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": "BOYETTE, JAMES MATTHEW",
    "status": "lost-primary",
    "BallotName": "JAMES BOYETTE"
  },
  {
    "Name": "Gary Buchanan",
    "SummaryLine": "Billings financial advisor",
    "LongSummary": "Buchanan, 73, is a Billings businessman who founded Buchanan Capital with his son Todd and wife, Norma, in 2002. He has served in economic-development roles in state government under both Republican and Democratic governors. He helped create the Montana Department of Commerce and served as its first director under Democratic Gov. Ted Schwinden and led a major effort to reorganize state government under Gov. Marc Racicot, a Republican.\n\nBuchanan has also served on the Montana Banking Board, Montana Board of Investments, Board of Crime Control, Montana Chamber of Commerce Board and Montana PBS Board.\n\nThis biography is based on materials supplied by Buchanan’s campaign and coverage by the Billings Gazette.",
    "Race": "US-House-2-East",
    "CampaignWebsiteUrl": "https://www.buchananformontana.com/",
    "CampaignFBPageUrl": "https://www.facebook.com/Buchanan-for-Montana-108315321829258",
    "CampaignTwitterUrl": "https://twitter.com/buchananforMT",
    "CampaignInstagramUrl": "https://www.instagram.com/buchananformontana/",
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:11:23.926Z",
    "updatedAt": "2022-11-14T22:51:04.590Z",
    "Party": "I",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": "BUCHANAN, GARY",
    "status": "advancing-to-general",
    "BallotName": "GARY BUCHANAN"
  },
  {
    "Name": "Sam Rankin",
    "SummaryLine": "Billings realtor and attorney",
    "LongSummary": "Rankin, 77, is a Billings attorney and real estate broker. He served as a Peace Corps volunteer and as a U.S. Army combat medic in Vietnam. He has been a licensed attorney in Montana since 2019.\n\nRankin has made several bids for federal office, running for the U.S. House as a Democrat in 2010 and 2012 and for U.S. Senate as an independent in 2014. Much of his current campaign’s rhetoric focuses on ending the influence of money on the political system. \n\nThis biography is based on material provided by Rankin, public records from the Montana secretary of state and archival coverage from the Billings Gazette. Rankin’s status as a licensed attorney was verified with the Montana State Bar.\n",
    "Race": "US-House-2-East",
    "CampaignWebsiteUrl": "https://rankinforcongress.com/",
    "CampaignFBPageUrl": "",
    "CampaignTwitterUrl": null,
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:11:51.881Z",
    "updatedAt": "2022-10-10T18:54:34.229Z",
    "Party": "L",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": "RANKIN, SAM",
    "status": "advancing-to-general",
    "BallotName": "SAM RANKIN"
  },
  {
    "Name": "Penny Ronning",
    "SummaryLine": "Former Billings Councilwoman",
    "LongSummary": "Ronning, 59, served on the Billings City Council from 2018 to 2021. She says she has worked as a business owner, photographer and filmmaker, and co-founded the Yellowstone County Area Human Trafficking Task Force. According to her LinkedIn resume, she helped found the Hatchfest Audio Visual Arts Festival in Bozeman and served as president of the Livingston Downtown Association.\n\nShe said at a May 8 candidate forum that she decided to run for the U.S. House after attending a portion of former president Donald Trump’s first impeachment trial in 2020 and being disappointed that some U.S. senators, who served as jurors in the trial, weren’t present for the proceedings.\n\nThis biography is based on material provided by Ronning and information on her website and social media accounts, verified where possible against public records and archival newspaper accounts.",
    "Race": "US-House-2-East",
    "CampaignWebsiteUrl": "https://www.pennyronning.com/",
    "CampaignFBPageUrl": "https://www.facebook.com/Penny4Congress",
    "CampaignTwitterUrl": "https://twitter.com/penny4congress",
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:12:16.334Z",
    "updatedAt": "2022-06-08T18:11:19.451Z",
    "Party": "D",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": "RONNING, PENNY",
    "status": "advancing-to-general",
    "BallotName": "PENNY RONNING"
  },
  {
    "Name": "Roger Roots",
    "SummaryLine": "Self-described “Libertarian gadfly”",
    "LongSummary": "Roots, 53, of Livingston, is a self-described liberty-oriented activist. According to a biography on his campaign website, Roots associated with skinheads and served time in federal prison for a gun charge in his early 20s. He writes that he went back to school after his release, ultimately earning a law degree and a PhD in sociology, and now runs an educational institution named after [19th-century anarchist Lysander Spooner](https://en.wikipedia.org/wiki/Lysander_Spooner).\n\nRoots has been a perennial Libertarian candidate, previously running for state auditor in 2020, Montana Supreme Court clerk in 2018, secretary of state in 2012 and 2016, and U.S. Senate in 2014. Roots was involved with the trial of Malheur National Wildlife Refuge occupation defendant Ryan Bundy [as a “volunteer paralegal.”](https://www.oregonlive.com/oregon-standoff/2016/08/montana_man_roger_roots_to_ser.html) Roots is licensed to practice law in Rhode Island, [according to the Rhode Island Bar Association](https://ribar.com/members/directory/?page=1&lname=Roots), but is not a member of the State Bar of Montana. \n\nRoots did not complete MTFP’s issues questionnaire. This biography is based on information presented on his campaign website, public records, news coverage, and his statements at a May 8 candidate forum.\n",
    "Race": "US-House-2-East",
    "CampaignWebsiteUrl": "https://rogerroots.com/",
    "CampaignFBPageUrl": "https://www.facebook.com/roger.roots.90",
    "CampaignTwitterUrl": null,
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:12:33.866Z",
    "updatedAt": "2022-06-08T18:11:23.934Z",
    "Party": "L",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": null,
    "status": "lost-primary",
    "BallotName": "ROGER ROOTS"
  },
  {
    "Name": "Mark Sweeney",
    "SummaryLine": "(Deceased) State senator from Philipsburg",
    "LongSummary": "Sweeney, 62, [died unexpectedly May 6](https://montanafreepress.org/2022/05/09/montana-us-house-candidate-sweeney-on-ballot-despite-death/), after primary ballots had been finalized. If he wins the Democratic primary posthumously, state law and party rules require the Montana Democratic Party to hold a nominating convention to select a new general election candidate.\n\nSweeney had served in the Montana Legislature since 2019 and had previously been an Anaconda-Deer Lodge county commissioner. He had said he was running this year to give Montana voters an alternative to incumbent Rep. Matt Rosendale.\n\nThis biography is based on public records and MTFP coverage following Sweeney’s death. Sweeney is unpictured here at the request of his family.\n",
    "Race": "US-House-2-East",
    "CampaignWebsiteUrl": "",
    "CampaignFBPageUrl": "",
    "CampaignTwitterUrl": "",
    "CampaignInstagramUrl": "",
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:12:44.107Z",
    "updatedAt": "2022-06-08T18:11:29.050Z",
    "Party": "D",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": "SWEENEY, MARK",
    "status": "lost-primary",
    "BallotName": "MARK SWEENEY"
  },
  {
    "Name": "Samuel Thomas",
    "SummaryLine": "Missoula resident",
    "LongSummary": "Thomas, 26, lives in Missoula. In written materials provided to MTFP, he described his experience as a signature gatherer for a marijuana legalization initiative and other issue campaigns.\n\nHe said that, if elected, he would push to legalize marijuana federally and advocate for rent control as a way to promote housing affordability.\n\nThis biography is based on information Thomas provided to MTFP in writing. ",
    "Race": "US-House-2-East",
    "CampaignWebsiteUrl": null,
    "CampaignFBPageUrl": null,
    "CampaignTwitterUrl": null,
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:13:12.060Z",
    "updatedAt": "2022-06-08T18:11:35.914Z",
    "Party": "L",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": null,
    "status": "lost-primary",
    "BallotName": "SAMUEL THOMAS"
  },
  {
    "Name": "Charles Walking Child",
    "SummaryLine": "Helena environmental contractor",
    "LongSummary": "Walking Child, 52, describes himself as a Anishinaabe tribal member who also has Blackfeet heritage. He lives in Helena, where he runs an environmental contracting company, Rising Lightning Environmental Contractors LLC, that he says focuses on asbestos, lead, mold and methamphetamine remediation.\n \nIn a May 8 candidate forum, he compared Washington, D.C. to the collapse of Rome and said he wants to reintroduce God into the American education system.\n\nWalking Child did not complete MTFP’s issues questionnaire. This biography is based on his statements at a May 8 candidate forum and material published on his Facebook page, verified against public records where possible.",
    "Race": "US-House-2-East",
    "CampaignWebsiteUrl": null,
    "CampaignFBPageUrl": "https://www.facebook.com/walkingchildforcongress",
    "CampaignTwitterUrl": null,
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:13:47.545Z",
    "updatedAt": "2022-06-08T18:10:43.983Z",
    "Party": "R",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": "WALKING CHILD, CHARLES A",
    "status": "lost-primary",
    "BallotName": "CHARLES A. WALKINGCHILD"
  },
  {
    "Name": "Skylar Williams",
    "SummaryLine": "Billings resident",
    "LongSummary": "Williams, 24, describes himself as a working-class Montanan who has had first-hand experience with hunger and homelessness as a child. He was born in Havre and grew up on the Rocky Boy’s Reservation and in Billings, he says.\n\nHe is campaigning for subsidized higher education, climate action, and lower health care costs.\n\nThis biography is based on information from Williams’ campaign website and written material he provided to MTFP.",
    "Race": "US-House-2-East",
    "CampaignWebsiteUrl": "https://skylarforuscongress.com/",
    "CampaignFBPageUrl": "https://www.facebook.com/Skylar-Williams-106852101816726/",
    "CampaignTwitterUrl": "https://www.twitter.com/Skylar4Montana",
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:14:04.239Z",
    "updatedAt": "2022-06-08T18:11:57.210Z",
    "Party": "D",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": "WILLIAMS, SKYLAR",
    "status": "lost-primary",
    "BallotName": "SKYLAR WILLIAMS"
  },
  {
    "Name": "K. Webb Galbreath",
    "SummaryLine": "Blackfeet Tribe Operations Manager",
    "LongSummary": "K. Webb Galbreath, 47, is a resident of Browning and the Blackfeet Tribe’s operations manager.\n\nAfter 10 years with the Marine Corps and a brief period working as a police officer with the Bureau of Indian Affairs, Galbreath enrolled at the University of Montana, where he earned degrees in political science and Native American studies. Since then, he’s held various positions with the Blackfeet Tribe. In 2021, he was hired as the tribe’s operations manager. He is also a rancher.\n\nGalbreath ran unsuccessfully for the Montana House of Representatives on the Republican ticket in 2018. He is married with three sons.\n\nThis biography is based on an interview with the candidate and information from Ballotpedia.",
    "Race": "PSC-District-1",
    "CampaignWebsiteUrl": null,
    "CampaignFBPageUrl": null,
    "CampaignTwitterUrl": null,
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:14:21.264Z",
    "updatedAt": "2022-06-08T18:15:39.255Z",
    "Party": "R",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": null,
    "status": "lost-primary",
    "BallotName": "K. WEBB GALBREATH"
  },
  {
    "Name": "Randy Pinocci",
    "SummaryLine": "Incumbent utility commissioner",
    "LongSummary": "Randy Pinocci, 57, was elected to the Public Service Commission in 2018. Prior to joining the commission, Pinocci ran a Great Falls printing service where he specialized in political direct mail.\n\nPinocci served a term in the Montana House of Representatives, where he sat on the Fish, Wildlife and Parks; Judiciary; and Federal Relations, Energy and Telecommunications committees. He has served on the Montana Shooting Sports Association board and chaired the Second Amendment Committee for the Republican Party.\n\nPinocci lives in Sun River with his wife and three children.\n\nThis biography is based on material from the Public Service Commission and Montana Legislature websites.",
    "Race": "PSC-District-1",
    "CampaignWebsiteUrl": null,
    "CampaignFBPageUrl": "https://www.facebook.com/randyformontana",
    "CampaignTwitterUrl": null,
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:14:39.307Z",
    "updatedAt": "2022-06-08T18:15:46.634Z",
    "Party": "R",
    "CampaignYoutubeUrl": null,
    "isIncumbent": true,
    "FECCandidateName": null,
    "status": "won-election",
    "BallotName": "RANDY PINOCCI"
  },
  {
    "Name": "Annie Bukacek",
    "SummaryLine": "Physician, former Flathead health board member",
    "LongSummary": "Bukacek, 64, is an internal medicine physician who runs a private medical practice in Kalispell and served a partial term on the Flathead City-County Health Department. Bukacek was appointed to the board in January of 2020 and announced her resignation this March, citing her run for the PSC. Bukacek’s name will appear on the ballot as “Ann Bukacek.”\n\nShe serves on the Montana Shooting Sports Association’s board of directors and has been president of the Montana Pro-life Coalition since 2008. Bukacek is widowed with five children and 14 grandchildren.\n\nThis biography is based on information on Bukacek’s candidate website and media coverage.",
    "Race": "PSC-District-5",
    "CampaignWebsiteUrl": "https://bukacek4psc.com/",
    "CampaignFBPageUrl": "",
    "CampaignTwitterUrl": null,
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:15:04.056Z",
    "updatedAt": "2022-07-19T15:03:41.955Z",
    "Party": "R",
    "CampaignYoutubeUrl": "https://www.youtube.com/channel/UC36_WUdnV9tKAN2WgJj0DEg",
    "isIncumbent": false,
    "FECCandidateName": null,
    "status": "advancing-to-general",
    "BallotName": "ANN BUKACEK"
  },
  {
    "Name": "Dean Crabb",
    "SummaryLine": "Retired utility worker",
    "LongSummary": "Dean Crabb is a retired lineman living in Marion.\n\nCrabb, 54, received an associate degree in electricity theory from Los Angeles Valley College and spent more than 20 years working as a lineman for the Los Angeles Department of Water and Power. Prior to that, he worked in other regulated industries including water, gas and fiber. \n\nThis is Crabb’s first run for an elected office. He is married and has three sons.\n\nThis biography is based on an interview with the candidate.",
    "Race": "PSC-District-5",
    "CampaignWebsiteUrl": null,
    "CampaignFBPageUrl": null,
    "CampaignTwitterUrl": null,
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:15:27.534Z",
    "updatedAt": "2022-06-08T18:38:48.146Z",
    "Party": "R",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": null,
    "status": "lost-primary",
    "BallotName": "DEAN CRABB"
  },
  {
    "Name": "Joe Dooling",
    "SummaryLine": "Helena-area farmer/rancher",
    "LongSummary": "Joe Dooling, 46, is a longtime Republican activist.\n\nDooling grew up on a ranch in Dillon, studied agribusiness and economics at Montana State University, and worked for KLG Engineering on infrastructure projects before becoming a full-time farmer and rancher. Dooling is the former chairman of the Lewis and Clark County Republican Central Committee. In 2019 he ran for the U.S. House, but did not advance beyond the primaries.\n\nHe lives in Helena with his wife, Julie, who serves in the Montana House of Representatives.\n\nThis biography is based on an interview with the candidate and media coverage of Dooling’s bids for elected office.",
    "Race": "PSC-District-5",
    "CampaignWebsiteUrl": null,
    "CampaignFBPageUrl": "https://www.facebook.com/joedoolingformontana",
    "CampaignTwitterUrl": null,
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:15:41.634Z",
    "updatedAt": "2022-06-13T20:32:57.747Z",
    "Party": "R",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": null,
    "status": "lost-primary",
    "BallotName": "JOE DOOLING"
  },
  {
    "Name": "Kevin Hamm",
    "SummaryLine": "Helena telecommunications professional",
    "LongSummary": "Hamm, 49, is CEO of Auxilyum Technologies and Treasure State Internet and Telegraph. Hamm describes himself as a fifth-generation telecommunications professional who’s also worked in the aviation, customer service and video production industries. He has served on the boards of Queen City Ballet and Healthy Mothers, Healthy Babies.\n\nHamm is also president of Big Sky Pride, a weeklong event celebrating Montana’s LGBTQ community, and founder of the Happiness & Joy Foundation, the nonprofit that produces Big Sky Pride.\n\nThis biography is based on material from Hamm’s candidate website and an MTFP interview with the candidate.",
    "Race": "PSC-District-5",
    "CampaignWebsiteUrl": "https://www.kevinhamm.com/",
    "CampaignFBPageUrl": "https://www.facebook.com/kevinmhamm",
    "CampaignTwitterUrl": "https://twitter.com/kevhamm",
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:15:58.758Z",
    "updatedAt": "2022-06-08T18:15:31.396Z",
    "Party": "D",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": null,
    "status": "lost-primary",
    "BallotName": "KEVIN HAMM"
  },
  {
    "Name": "John Repke",
    "SummaryLine": "Retired executive",
    "LongSummary": "Repke, 64, studied finance at Ohio State University and the University of Denver, where he earned an MBA. His professional experience includes nine years with Waste Management and nine years with Havi Group, LLP, a supply chain management company. Most recently, he was the chief financial officer of a sustainable wood products manufacturer in Columbia Falls. He retired from SmartLam, LLC, in 2021.\n\nRepke and his wife, Beth, moved to Whitefish full-time in 2014. He’s taught business classes for local organizations including Flathead Valley Community College, Confederated Salish and Kootenai Tribes’ Economic Development Office and Lake County Community Development Corporation.\n\nRepke is married with three children and two grandchildren.\n\nThis biography is based on an MTFP interview with the candidate and material on Repke’s campaign website. ",
    "Race": "PSC-District-5",
    "CampaignWebsiteUrl": "https://repke4psc5.com/",
    "CampaignFBPageUrl": null,
    "CampaignTwitterUrl": null,
    "CampaignInstagramUrl": "https://www.instagram.com/repke4psc5/",
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:18:50.984Z",
    "updatedAt": "2022-06-08T18:15:25.913Z",
    "Party": "D",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": null,
    "status": "advancing-to-general",
    "BallotName": "JOHN REPKE"
  },
  {
    "Name": "Derek Skees",
    "SummaryLine": "Former Montana House Energy Committee chair",
    "LongSummary": "Skees, 53, served four terms in the Montana House of Representatives representing the Kalispell area.\n\nDuring his tenure in the Legislature, Skees chaired the Energy and Telecommunications Interim Committee and the House Energy, Technology and Federal Relations Committee. He is a member of the Flathead Republicans.\n\nSkees received an associate degree from Seminole Community College and attended the University of Central Florida. Skees’ professional experience includes management positions in the tourism, construction and postal service industries.\n\nSkees lives in Kalispell with his wife, Ronalee. He has three children and five grandchildren.\n\nThis biography is based on information from MTFP interviews and Skees’ candidate website and LinkedIn profile.",
    "Race": "PSC-District-5",
    "CampaignWebsiteUrl": "https://derekskees.com/",
    "CampaignFBPageUrl": "https://www.facebook.com/derekskees",
    "CampaignTwitterUrl": "https://twitter.com/derekskees",
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:19:02.002Z",
    "updatedAt": "2022-07-19T15:03:30.624Z",
    "Party": "R",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": null,
    "status": "lost-primary",
    "BallotName": "DEREK SKEES"
  },
  {
    "Name": "Bill D'Alton",
    "SummaryLine": "Billings attorney",
    "LongSummary": "D’Alton, 59, is a Billings-based attorney who has practiced law in Montana for more than 20 years. He represents both plaintiffs and defendants at D’Alton Law Firm P.C. According to his professional website, D’Alton has tried jury cases in several types of Montana courts. He has also appealed cases before the Montana Supreme Court and the U.S. Court of Appeals for the 9th Circuit.\n\nD’Alton has said that, if elected, he plans to serve only one eight-year term, which he says will help him maintain independence as a jurist.\n\nD’Alton earned his law degree from the University of Montana and was admitted to the State Bar of Montana in 1995.\n\nThis biography is based on campaign materials and interviews with D’Alton.",
    "Race": "SupCo-1",
    "CampaignWebsiteUrl": null,
    "CampaignFBPageUrl": null,
    "CampaignTwitterUrl": null,
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:19:17.161Z",
    "updatedAt": "2022-06-08T18:14:43.682Z",
    "Party": "NP",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": null,
    "status": "advancing-to-general",
    "BallotName": "BILL DALTON"
  },
  {
    "Name": "Jim Rice",
    "SummaryLine": "Incumbent Supreme Court Justice",
    "LongSummary": "Rice, 64, is the court’s longest-serving current member, having served as a justice since 2001. He was appointed to his seat in 2001 by Republican Gov. Judy Martz, and won reelection in 2002, 2006 and 2014.\n\nBefore becoming a justice, Rice was an attorney in private practice and a three-time Republican legislator representing East Helena. He graduated from the University of Montana School of Law and was admitted to the State Bar of Montana in 1982.\n\nThis biography is based on campaign materials and interviews with Rice.\n",
    "Race": "SupCo-1",
    "CampaignWebsiteUrl": "http://www.jimriceforjustice.com/",
    "CampaignFBPageUrl": "https://www.facebook.com/jimrice4justice",
    "CampaignTwitterUrl": "https://twitter.com/jimrice4justice",
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:19:29.798Z",
    "updatedAt": "2022-06-08T18:14:38.521Z",
    "Party": "NP",
    "CampaignYoutubeUrl": null,
    "isIncumbent": true,
    "FECCandidateName": null,
    "status": "advancing-to-general",
    "BallotName": "JIM RICE"
  },
  {
    "Name": "James Brown",
    "SummaryLine": "Public Service Commission chairman",
    "LongSummary": "Brown, 51, from Dillon, has operated his private practice law firm in Helena since 2012. He is also the current chairman of the Public Service Commission, which he campaigned for in 2020. \n\nBrown served as legal counsel for the Montana Republican Party from 2009 to 2015 and has continued to represent the GOP in recent cases. In that time period he also represented American Tradition Partnership, a conservative political organization.\n\nBrown earned his J.D. from Seattle University in 2004. He was admitted to the State Bar of Montana in 2007.\n\nThis biography is based on campaign materials and interviews with Brown.",
    "Race": "SupCo-2",
    "CampaignWebsiteUrl": "https://www.jamesbrownformontana.com/",
    "CampaignFBPageUrl": null,
    "CampaignTwitterUrl": null,
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:19:40.855Z",
    "updatedAt": "2022-06-08T18:14:27.900Z",
    "Party": "NP",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": null,
    "status": "advancing-to-general",
    "BallotName": "JAMES BROWN"
  },
  {
    "Name": "Ingrid Gustafson",
    "SummaryLine": "Incumbent Supreme Court Justice",
    "LongSummary": "Gustafson, 60, has served on the Montana Supreme Court since 2017, when she was appointed by Democratic Gov. Steve Bullock. She won re-election in 2018. \n\nPrior to joining the state’s high court, Gustafson served as a district court judge in Yellowstone County for 14 years, a position to which she was appointed by Republican Gov. Judy Martz in 2004. While on the bench in Yellowstone County, Gustafson started a felony drug treatment court and a pilot court to expedite and improve outcomes in child neglect cases.\n\nGustafson received her law degree from the University of Montana and was admitted to the State Bar of Montana in 1988.\n\nThis biography is based on campaign materials and interviews with Gustafson.",
    "Race": "SupCo-2",
    "CampaignWebsiteUrl": "https://www.gustafsonformontana.com/",
    "CampaignFBPageUrl": "https://www.facebook.com/Gustafson4Montana",
    "CampaignTwitterUrl": null,
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:19:57.997Z",
    "updatedAt": "2022-06-08T18:14:22.019Z",
    "Party": "NP",
    "CampaignYoutubeUrl": null,
    "isIncumbent": true,
    "FECCandidateName": null,
    "status": "advancing-to-general",
    "BallotName": "INGRID GUSTAFSON"
  },
  {
    "Name": "Mike McMahon",
    "SummaryLine": "First Judicial District Court judge",
    "LongSummary": "McMahon, 57, of Helena, has been on the bench as a district court judge serving Lewis and Clark and Broadwater counties since 2016. In recent years, McMahon has taken over the handing of adult cases in family court for the district.\n\nPrior to that, McMahon practiced as a civil defense attorney, representing Blue Cross Blue Shield of Montana in insurance disputes and doctors and attorneys facing malpractice lawsuits.  \n\nMcMahon graduated from the Gonzaga University School of Law in 1991. After starting his legal career in North Dakota, he was admitted to the State Bar of Montana in 1992 and returned to Helena to continue practicing in 1996. \n\nThis biography is based on campaign materials and interviews with McMahon.",
    "Race": "SupCo-2",
    "CampaignWebsiteUrl": "https://electjudgemcmahon.com/",
    "CampaignFBPageUrl": "https://www.facebook.com/McMahonforMontanaSupremeCourt/",
    "CampaignTwitterUrl": null,
    "CampaignInstagramUrl": null,
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:20:38.566Z",
    "updatedAt": "2022-06-08T18:14:16.524Z",
    "Party": "NP",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": null,
    "status": "lost-primary",
    "BallotName": "MICHAEL F. MCMAHON"
  },
  {
    "Name": "Cora Neumann",
    "SummaryLine": "Public health and public lands advocate",
    "LongSummary": "Neumann, 47, was raised in Bozeman. After spending much of her professional career living across the U.S. and abroad, Neumann returned to live in Bozeman full-time in 2019, where she and her husband are raising their two kids.\n\nNeumann, who has a PhD in public health from Oxford University, spent the last two decades working in international health, economic development and public lands advocacy. She founded the Global First Ladies Alliance and has been an adviser for the U.S. State Department and the George W. Bush Presidential Center, among other professional positions. \n\nNeumann launched a campaign for one of Montana’s U.S. Senate seats in 2019 but dropped out when former Gov. Steve Bullock entered the race.\n\nThis biography was compiled with information from a candidate interview and Neumann’s LinkedIn page.",
    "Race": "US-House-1-West",
    "CampaignWebsiteUrl": "https://coraformontana.com/",
    "CampaignFBPageUrl": "https://www.facebook.com/CoraForMontana",
    "CampaignTwitterUrl": "https://twitter.com/CoraforMT",
    "CampaignInstagramUrl": "https://www.instagram.com/coraformontana",
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-19T19:29:22.619Z",
    "updatedAt": "2022-06-08T18:13:59.649Z",
    "Party": "D",
    "CampaignYoutubeUrl": null,
    "isIncumbent": false,
    "FECCandidateName": "NEUMANN, CORA",
    "status": "lost-primary",
    "BallotName": "CORA NEUMANN"
  },
  {
    "Name": "Mary Todd",
    "SummaryLine": "Pastor, small business owner",
    "LongSummary": "Todd gained prominence as a public figure in the Flathead Valley after the death of her son Shane, who Todd says was murdered in Singapore in 2012. Since then, Todd has been an outspoken critic of the Chinese and Singapore governments. \n\nIn her congressional campaign, Todd has described herself as an “unapologetic America First conservative.” Political priorities listed on her campaign website include making the U.S. more competitive in global trade and foreign policy, opposing abortion and completing a wall across the U.S. southern border with Mexico.\n\nTodd did not complete MTFP’s issues questionnaire. This biography was completed with information from the candidate’s campaign and business websites and archival news articles.",
    "Race": "US-House-1-West",
    "CampaignWebsiteUrl": "https://www.marytoddformt.com/",
    "CampaignFBPageUrl": "https://www.facebook.com/MaryToddForMT",
    "CampaignTwitterUrl": "https://mobile.twitter.com/marytoddformt",
    "CampaignInstagramUrl": "https://www.instagram.com/marytoddformt/",
    "MtfpCoverageTag": null,
    "createdAt": "2022-04-27T21:09:21.851Z",
    "updatedAt": "2022-06-08T18:14:10.982Z",
    "Party": "R",
    "CampaignYoutubeUrl": "https://www.youtube.com/channel/UCJlMtSvN5JZGcW7lOKCobkQ",
    "isIncumbent": false,
    "FECCandidateName": "TODD, MARY BROOKS",
    "status": "lost-primary",
    "BallotName": "MARY TODD"
  }
]