{
  "overviewLedeIn": "Heading into the 2024 election, Montana voters have the task of selecting from more than 60 candidates to fill 14 Montana-specific federal and state offices — not to mention picking from among the 300-plus candidates running for positions in the state Legislature.\n\nThat can be a baffling number of names to track even for voters who dilligently follow political news. This digital guide, a project of the nonpartisan Montana Free Press newsroom, is an effort make sure basic information is available so voters have the opportunity to cast informed votes.\n\nThe 2024 primary election, where voters will pick each political party's nominee to advance to the General Election, will be held **June 4**. The 2024 general election will be held **Nov. 5**.\n",
  "overviewBallotInitiatives": "Issue votes can be placed on the November General Election ballot either by referral from the Legislature or by citizen initiative when backers clear voter signature-gathering thresholds.\n\nAs of May 1, no issues had qualified for the 2024 ballot, though several, including an issue that [would enshrine abortion rights in the Montana Contitution](https://montanafreepress.org/2024/04/05/montanas-constitutional-abortion-amendment-cleared-for-signature-gathering/) and two others [that would adjust how the state's elections are conducted](https://montanafreepress.org/2023/08/22/proposed-ballot-initiatives-would-mean-big-changes-for-montana-elections/), have been cleared for signature gathering. \n\nTo qualify their initiatives for the 2024 ballot, backers must submit enough signatures to county election administrators by **June 21, 2024**. A complete list of proposed 2024 initiatives and their status is available [on the Montana Secretary of State's website](https://sosmt.gov/elections/ballot_issues/proposed-2024-ballot-issues/).\n",
  "overviewLegislatureLedeIn": "Montanans elect 100 state representatives to two-year terms and 25 of 50 state senators to four-year terms in each even-year election. This year's election is the first to be conducted using [a new legislative district map](https://montanafreepress.org/2023/02/13/montana-redistricting-commission-finalizes-new-house-senate-maps/) drawn to account for population shifts recorded by the 2020 census. \n\nEach Senate district is composed of two House districts.\n",
  "questionnaireStateOfficeLedein": "Answers here were solicited from candidates via a written questionnaire conducted by MTFP in April 2024. Responses were limited to 1,000 characters and edited lightly for punctuation and spelling. Candidates were asked to focus on the positives their service would bring the state instead of making rhetorical attacks on their opponents. Responses have not been exhaustively fact-checked.\n",
  "questionnaireLegislatureLedein": "Answers here were solicited from legislative candidates via a written questionnaire in April 2024, conducted in collaboration between MTFP and the Montana League of Women Voters. Responses here are presented exactly as submitted, without fact-checking or editing for minor punctuation or spelling errors.\n\nLegislative candidates who haven't submitted answers to these questions can do so at any time by contacting montanalwv@gmail.com or calling 406-233-9015.\n",
  "overviewAlsoOnYourBallot": "June primary and November general election ballots may also include other items such as county commission races, depending on where in the state you live. June 2024 ballots will also ask voters to whether they wish to set up [local government study commissions](https://www.montana.edu/extension/localgov/mtvoterreview/index.html) to review the structure of their city and county governments.\n",
  "overviewAboutThisProject": "This guide was produced by the Montana Free Press newsroom with production and web development by Eric Dietrich, editing by Brad Tyer and contributions from Arren Kimbel-Sannit, Mara Silvers, Alex Sakariassen, Amanda Eggert and Stephanie Farmer. Contact Eric Dietrich with questions, corrections or suggestions at edietrich@montanafreepress.org\n\nMontana Free Press is a nonpartisan 501(c)(3) nonprofit, reader-supported news organization serving Montana. MTFP's donor base includes supporters from across Montana's political spectrum, including some Montanans who are candidates in this year's election. MTFP's [major donors are listed here](https://montanafreepress.org/donor-transparency) and a current list of [other supporters is available here](https://montanafreepress.org/mtfp-members/). MTFP's news judgments are made entirely independently from donor involvement. \n\nThis material is available for republication by other media outlets under Montana Free Press' [standard distribution terms](https://montanafreepress.org/publish-our-stories/).\n"
}